Tekla Open API Reference for Tekla Structures 2025
LeaderLinePlacing.StartPoint Property
 The start point of the leader line (if multiple leader lines exist, only returns the first).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point StartPoint { get; }
Public ReadOnly Property StartPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
LeaderLinePlacing Class
Tekla.Structures.Drawing Namespace